package ServerSonet;

import java.io.IOException;

/**
 * <b>Зробив:</b>
 * <pre>Авраменко Нікіта</pre>
 * <b>Дата виконання завдання:</b>
 * <pre>08.12.2020 18:00:00</pre>
 * <b>Умова:</b>
 * <br>Клієнт при зверненні до сервера отримує випадково обраний сонет
 * Шекспіра з файлу. Сервер розсилає повідомлення обраним зі списку клієнтам. перелік
 * зберігається в файлі. Сервер розсилає повідомлення в певний час певним
 * клієнтам. Сервер розсилає повідомлення тільки тим клієнтам, які в даний момент
 * знаходяться в on-line.
 */
public class StartServer {
    public static void main(String[] args) throws IOException {
        Server server = new Server();
    }
}
